
<!-- terraform-plan-prod -->
### 🌍 Terraform Plan – **PROD**

<details>
<summary>Click to expand</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.eks.aws_iam_role.eks_cluster_role: Refreshing state... [id=prod-eks-cluster-role]
module.vpc.aws_eip.nat: Refreshing state... [id=eipalloc-05b22bc5a1e4fa79d]
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-00654952d373d1143]
module.eks.aws_iam_role.node_role: Refreshing state... [id=prod-eks-node-role]
module.eks.aws_iam_role_policy_attachment.worker_node_policy: Refreshing state... [id=prod-eks-node-role-20260119060301527400000003]
module.eks.aws_iam_role_policy_attachment.ecr_policy: Refreshing state... [id=prod-eks-node-role-20260119060301494200000002]
module.eks.aws_iam_role_policy_attachment.cni_policy: Refreshing state... [id=prod-eks-node-role-20260119060301422700000001]
module.eks.aws_iam_role_policy_attachment.cluster_policy_attachment: Refreshing state... [id=prod-eks-cluster-role-20260119060301537700000004]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-08316328119a8c5ec]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0d77b6302b741cebc]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0b4b3dc5291aa02ec]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0e1dd0b60b63f8263]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0a25e972aed7bba76]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0a2714b197f37761d]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-00897c054a966123c]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0f5a4305adb4f0d23]
module.eks.aws_eks_cluster.this: Refreshing state... [id=Shared-cluster]
module.vpc.aws_nat_gateway.this: Refreshing state... [id=nat-013b4956806c36e2b]
module.vpc.aws_route_table_association.public["2"]: Refreshing state... [id=rtbassoc-067271fde6e53af51]
module.vpc.aws_route_table_association.public["1"]: Refreshing state... [id=rtbassoc-05b664995e7900d34]
module.vpc.aws_route_table_association.public["0"]: Refreshing state... [id=rtbassoc-00f2b7e7c2061fe68]
module.vpc.aws_route_table.private: Refreshing state... [id=rtb-05d52f35caade8531]
module.vpc.aws_route_table_association.private["0"]: Refreshing state... [id=rtbassoc-09a66beb055036092]
module.vpc.aws_route_table_association.private["2"]: Refreshing state... [id=rtbassoc-05cbb3bc74b515de5]
module.vpc.aws_route_table_association.private["1"]: Refreshing state... [id=rtbassoc-023f512829075410c]
module.eks.aws_security_group_rule.alloow_private_endpoint_access[0]: Refreshing state... [id=sgrule-3641172089]
module.eks.aws_eks_node_group.this: Refreshing state... [id=Shared-cluster:prod-eks-node-group]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.eks.aws_eks_cluster.this must be replaced
-/+ resource "aws_eks_cluster" "this" {
      ~ arn                           = "arn:aws:eks:ap-northeast-2:358871393576:cluster/Shared-cluster" -> (known after apply)
      ~ certificate_authority         = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJYmZ2Mm5VVTY2S1l3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TmpBeE1Ua3dOakF6TWpSYUZ3MHpOakF4TVRjd05qQTRNalJhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUUNvQlR4T05ZSlkra3BYWmFJSXBhWngvWktodUhwTmZFaVhDcnE4RGVMNjNjYnRDRkRVN0NLZlpGcjAKMklzV1NwTkk3aXpaaW9VMzJuQ05qN1FTYjlhbUlBNDNjYXlZOTFNVk5UQTRyS25lL1RRRWFHVUMzekV3RnVjbQphRzJSZzk0Vlp3VDRZVnFDaHFQWEhvY1JpWGVSSHZSa213bCtYdEVSNnBpVElmNkR0QUJqNC92MnZ6T2J2MEswCmNnRmNFdis0d0VrMDBTOFcwRXZiOGVQZXdLbkRjMW84bGJEdk8xUzEwZTdFV3FsdDlhMjNMV0lac09tYzRYN3MKb1c1QVp4SFZ0QjAvbTBHbm5KM09aLysveUVoQStMMHVkNzVnejczQmJYUG5OcnRJMUpScmorNmVkL25RUm16eAp3dk41ZkRZangvKy9DSEE4SWllVXVtSytwb1JQQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJSZW9mRTBJa056K3N0eThHdU55b1RPVGY3MExqQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQTRiUTQyaGZ2dwp2VXdzalFlemx4aXA3RlNGVGRHU1B5Y1dBVjFxdzc2Mk94amw4b3dWTzlQWXFqSThWalNjR1hnNkJDS2RFb1RrClJLd0oxYTNGR2k3dkVLWDRmLzJob0tVL0t2L2J0Y2RPc3FWemFLYXZuU2pTZ282aVFaNytvdmNOcy91ZHZMdTgKbDdvdjdBRGIzeEtweDQyLzRyYktodDdPV25VTHVjclJmZEd2blBXL1A0WEN1cUc0Wk9MOC9TN0QyQWowNE45QQpXeTV5ejF5VjlERWV2UnIwNGR6SnVKWHU3Z1N0RVhMWFhjTlJvU1VWcW03anloekN5Q1N6UmJxUjVvdi9qZUFjClVFajRBTHZ1M0NUU054M05JOTZIUG1YR3lpQTJYTkJnQXMrQzhRVXEvT1RZZXRQTmhBbWFybmlWWlBRbHVDdWoKZjFzREI3ekJFR0FzCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            },
        ] -> (known after apply)
      + cluster_id                    = (known after apply)
      ~ created_at                    = "2026-01-19T06:03:22Z" -> (known after apply)
      - enabled_cluster_log_types     = [] -> null
      ~ endpoint                      = "https://4532B6D09C44DF68B329E728A8642411.yl4.ap-northeast-2.eks.amazonaws.com" -> (known after apply)
      ~ id                            = "Shared-cluster" -> (known after apply)
      ~ identity                      = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.ap-northeast-2.amazonaws.com/id/4532B6D09C44DF68B329E728A8642411"
                    },
                ]
            },
        ] -> (known after apply)
        name                          = "Shared-cluster"
      ~ platform_version              = "eks.12" -> (known after apply)
      ~ status                        = "ACTIVE" -> (known after apply)
        tags                          = {
            "Name" = "prod-eks-cluster"
            "name" = "prod-1"
        }
        # (4 unchanged attributes hidden)

      ~ access_config {
          ~ authentication_mode                         = "CONFIG_MAP" -> "API_AND_CONFIG_MAP"
          - bootstrap_cluster_creator_admin_permissions = true -> null # forces replacement
        }

      - kubernetes_network_config {
          - ip_family         = "ipv4" -> null
          - service_ipv4_cidr = "10.100.0.0/16" -> null

          - elastic_load_balancing {
              - enabled = false -> null
            }
        }

      - upgrade_policy {
          - support_type = "EXTENDED" -> null
        }

      ~ vpc_config {
          ~ cluster_security_group_id = "sg-011ee2680b42e1498" -> (known after apply)
          ~ public_access_cidrs       = [
              - "0.0.0.0/0",
            ] -> (known after apply)
          - security_group_ids        = [] -> null
          ~ vpc_id                    = "vpc-00654952d373d1143" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # module.eks.aws_security_group_rule.alloow_private_endpoint_access[0] must be replaced
-/+ resource "aws_security_group_rule" "alloow_private_endpoint_access" {
      ~ id                       = "sgrule-3641172089" -> (known after apply)
      ~ security_group_id        = "sg-011ee2680b42e1498" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0475bac8c478c7416" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.eks_access.aws_eks_access_entry.admin[0] will be created
  + resource "aws_eks_access_entry" "admin" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "Shared-cluster"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::358871393576:role/dev-eks-admin-role"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks_access.aws_eks_access_entry.readonly["dev_readonly"] will be created
  + resource "aws_eks_access_entry" "readonly" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "Shared-cluster"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::358871393576:role/dev-eks-readonly-role"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks_access.aws_eks_access_policy_association.admin[0] will be created
  + resource "aws_eks_access_policy_association" "admin" {
      + associated_at = (known after apply)
      + cluster_name  = "Shared-cluster"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::358871393576:role/dev-eks-admin-role"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.eks_access.aws_eks_access_policy_association.readonly["dev_readonly"] will be created
  + resource "aws_eks_access_policy_association" "readonly" {
      + associated_at = (known after apply)
      + cluster_name  = "Shared-cluster"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSViewPolicy"
      + principal_arn = "arn:aws:iam::358871393576:role/dev-eks-readonly-role"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.vpc.aws_route_table.private will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-05d52f35caade8531"
      ~ route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-013b4956806c36e2b"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "nat-013b4956806c36e2b"
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "prod-private-rt"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 6 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ cluster_ca         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJYmZ2Mm5VVTY2S1l3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TmpBeE1Ua3dOakF6TWpSYUZ3MHpOakF4TVRjd05qQTRNalJhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUUNvQlR4T05ZSlkra3BYWmFJSXBhWngvWktodUhwTmZFaVhDcnE4RGVMNjNjYnRDRkRVN0NLZlpGcjAKMklzV1NwTkk3aXpaaW9VMzJuQ05qN1FTYjlhbUlBNDNjYXlZOTFNVk5UQTRyS25lL1RRRWFHVUMzekV3RnVjbQphRzJSZzk0Vlp3VDRZVnFDaHFQWEhvY1JpWGVSSHZSa213bCtYdEVSNnBpVElmNkR0QUJqNC92MnZ6T2J2MEswCmNnRmNFdis0d0VrMDBTOFcwRXZiOGVQZXdLbkRjMW84bGJEdk8xUzEwZTdFV3FsdDlhMjNMV0lac09tYzRYN3MKb1c1QVp4SFZ0QjAvbTBHbm5KM09aLysveUVoQStMMHVkNzVnejczQmJYUG5OcnRJMUpScmorNmVkL25RUm16eAp3dk41ZkRZangvKy9DSEE4SWllVXVtSytwb1JQQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJSZW9mRTBJa056K3N0eThHdU55b1RPVGY3MExqQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQTRiUTQyaGZ2dwp2VXdzalFlemx4aXA3RlNGVGRHU1B5Y1dBVjFxdzc2Mk94amw4b3dWTzlQWXFqSThWalNjR1hnNkJDS2RFb1RrClJLd0oxYTNGR2k3dkVLWDRmLzJob0tVL0t2L2J0Y2RPc3FWemFLYXZuU2pTZ282aVFaNytvdmNOcy91ZHZMdTgKbDdvdjdBRGIzeEtweDQyLzRyYktodDdPV25VTHVjclJmZEd2blBXL1A0WEN1cUc0Wk9MOC9TN0QyQWowNE45QQpXeTV5ejF5VjlERWV2UnIwNGR6SnVKWHU3Z1N0RVhMWFhjTlJvU1VWcW03anloekN5Q1N6UmJxUjVvdi9qZUFjClVFajRBTHZ1M0NUU054M05JOTZIUG1YR3lpQTJYTkJnQXMrQzhRVXEvT1RZZXRQTmhBbWFybmlWWlBRbHVDdWoKZjFzREI3ekJFR0FzCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)
  ~ cluster_endpoint   = "https://4532B6D09C44DF68B329E728A8642411.yl4.ap-northeast-2.eks.amazonaws.com" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
